# DART-YOLO full configuration.
# Core modules: CSD, DRFM, LMSA, and DGAM.

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, CSD, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, DRFM, [256, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, DRFM, [512, False, 0.25]]
  - [-1, 1, CSD, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, DRFM, [512, True]]
  - [-1, 1, CSD, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, DRFM, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, LMSA, [1024]]            # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]      # 13, P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]      # 16, P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]      # 19, P2

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]      # 22, P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]      # 25, P4

  - [-1, 1, CSD, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]      # 28, P5

  - [19, 1, DGAM, [256]]             # 29, DGAM after P2 branch
  - [[29, 22, 25, 28], 1, Detect, [nc]]
